Code-Newborn/STM32_nRF24L01/STM32F103C8T6_Transmitter/HARDWARE/nRF24L01P/nRF24L01P.c
HAL_StatusTypeDef HAL_nRF24L01P_DPLPipe( nRF24L01P* nRF, nRF_DATA_PIPE Pipe, nRF_STATE DPL_State ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_DYNPD, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    if ( DPL_State ) {
        regValue |= ( 1 << Pipe );
    }
    else {
        regValue &= ~( 1 << Pipe );
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_DYNPD, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_DynPayload( nRF24L01P* nRF, nRF_STATE DPL_State ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_FEATURE, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    if ( DPL_State ) {
        regValue |= ( 1 << 2 );
    }
    else {
        regValue &= ~( 1 << 2 );
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_FEATURE, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_ACKPayload( nRF24L01P* nRF, nRF_STATE ACK_State ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_FEATURE, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    if ( ACK_State ) {
        regValue |= ( 1 << 1 );
    }
    else {
        regValue &= ~( 1 << 1 );
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_FEATURE, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_DynACK( nRF24L01P* nRF, nRF_STATE ACK_State ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_FEATURE, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    if ( ACK_State ) {
        regValue |= ( 1 << 0 );
    }
    else {
        regValue &= ~( 1 << 0 );
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_FEATURE, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_MaxReTransmitIRQ( nRF24L01P* nRF, nRF_STATE IRQ_State ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_CONFIG, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    if ( IRQ_State ) {
        regValue &= ~( 1 << 4 );
    }
    else {
        regValue |= ( 1 << 4 );
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_CONFIG, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_TXDataSentIRQ( nRF24L01P* nRF, nRF_STATE IRQ_State ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_CONFIG, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    if ( IRQ_State ) {
        regValue &= ~( 1 << 5 );
    }
    else {
        regValue |= ( 1 << 5 );
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_CONFIG, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_RXDataReadyIRQ( nRF24L01P* nRF, nRF_STATE IRQ_State ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_CONFIG, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    if ( IRQ_State ) {
        regValue &= ~( 1 << 6 );
    }
    else {
        regValue |= ( 1 << 6 );
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_CONFIG, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_TXRX( nRF24L01P* nRF, nRF_TXRX_STATE TxRx_State ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_CONFIG, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    if ( TxRx_State ) {
        regValue |= ( 1 );
        nRF->State = nRF_STATE_TX;
    }
    else {
        regValue &= ~( 1 );
        nRF->State = nRF_STATE_RX;
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_CONFIG, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_PowerUP( nRF24L01P* nRF, nRF_STATE Power ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_CONFIG, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    if ( Power ) {
        regValue |= ( 1 << 1 );
    }
    else {
        regValue &= ~( 1 << 1 );
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_CONFIG, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_SetCRCWidth( nRF24L01P* nRF, nRF_CRC_WIDTH CRC_Width ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_CONFIG, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    if ( CRC_Width ) {
        regValue |= ( 1 << 2 );
    }
    else {
        regValue &= ~( 1 << 2 );
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_CONFIG, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_CRC( nRF24L01P* nRF, nRF_STATE CRC_State ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_CONFIG, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    if ( CRC_State ) {
        regValue |= ( 1 << 3 );
    }
    else {
        regValue &= ~( 1 << 3 );
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_CONFIG, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_AutoACK( nRF24L01P* nRF, nRF_DATA_PIPE Pipe, nRF_STATE ACK_State ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_EN_AA, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

    Pipe &= ( 0x3F );  // nRF_EN_AA reg's 6. and 7. bits are Reserved
    if ( ACK_State ) {
        regValue |= ( 1 << Pipe );  // nRF_EN_AA reg is Configured
    }
    else {
        regValue &= ~( 1 << Pipe );  // nRF_EN_AA reg is Configured
    }
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_WriteRegister( nRF, nRF_EN_AA, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_RXPipe( nRF24L01P* nRF, nRF_DATA_PIPE Pipe, nRF_STATE Pipe_State ) {
    /* ---- Local Vars. ---- */
    uint8_t regValue;
    /* ---- Pre Process ---- */
    if ( HAL_nRF24L01P_ReadRegister( nRF, nRF_EN_RXADDR, &regValue ) != HAL_OK ) {
        return HAL_ERROR;
    }

