Code-Newborn/STM32_nRF24L01/STM32F103C8T6_Transmitter/HARDWARE/nRF24L01P/nRF24L01P.c
HAL_StatusTypeDef HAL_nRF24L01P_ReadRXPayload( nRF24L01P* nRF, uint8_t* pRegData ) {
    /* ---- Local Vars. ---- */
    uint8_t* Zero = ( uint8_t* )malloc( ( nRF->PayloadWidth ) * sizeof( uint8_t ) );
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_SendCommand( nRF, nRF_CMD_R_RX_PAYLOAD, Zero, pRegData, nRF->PayloadWidth ) != HAL_OK ) {
        free( Zero );
        return HAL_ERROR;
    }
    free( Zero );
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_WriteTXPayload( nRF24L01P* nRF, uint8_t* pRegData ) {
    /* ---- Local Vars. ---- */
    uint8_t* Zero = ( uint8_t* )malloc( ( nRF->PayloadWidth ) * sizeof( uint8_t ) );
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_SendCommand( nRF, nRF_CMD_W_TX_PAYLOAD, pRegData, Zero, nRF->PayloadWidth ) != HAL_OK ) {
        free( Zero );
        return HAL_ERROR;
    }
    free( Zero );
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_WriteTXPayloadACK( nRF24L01P* nRF, uint8_t* pRegData, nRF_DATA_PIPE Pipe ) {
    /* ---- Local Vars. ---- */
    uint8_t* Zero = ( uint8_t* )malloc( ( nRF->PayloadWidth ) * sizeof( uint8_t ) );
    Pipe &= 0x07;
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_SendCommand( nRF, nRF_CMD_W_ACK_PAYLOAD + Pipe, pRegData, Zero, nRF->PayloadWidth ) != HAL_OK ) {
        free( Zero );
        return HAL_ERROR;
    }
    free( Zero );
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_WriteRegister( nRF24L01P* nRF, uint8_t regAddr, uint8_t* pRegData ) {
    /* ---- Local Vars. ---- */
    uint8_t Zero = 0x00;
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_SendCommand( nRF, nRF_CMD_W_REGISTER + regAddr, pRegData, &Zero, 1 ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_ReadRegister( nRF24L01P* nRF, uint8_t regAddr, uint8_t* pRegData ) {
    /* ---- Local Vars. ---- */
    uint8_t Zero = 0x00;
    /* ---- Fcn Process ---- */
    if ( HAL_nRF24L01P_SendCommand( nRF, nRF_CMD_R_REGISTER + regAddr, &Zero, pRegData, 1 ) != HAL_OK ) {
        return HAL_ERROR;
    }
    return HAL_OK;
}

HAL_StatusTypeDef HAL_nRF24L01P_SendCommand( nRF24L01P* nRF, uint8_t Command, uint8_t* TxBuffer, uint8_t* RxBuffer, uint8_t Size ) {
    /* ---- Local Vars. ---- */
    uint8_t* tempTxBuffer = ( uint8_t* )malloc( ( Size + 1 ) * sizeof( uint8_t ) );
    uint8_t* tempRxBuffer = ( uint8_t* )malloc( ( Size + 1 ) * sizeof( uint8_t ) );
    /* ---- Pre Process ---- */
    tempTxBuffer[ 0 ] = Command;
    tempRxBuffer[ 0 ] = 0x00;
    for ( uint8_t i = 0; i < Size; i++ ) {
        tempTxBuffer[ i + 1 ] = TxBuffer[ i ];  // Fill tempTxBuffer with Command + All of TxBuffer
        tempRxBuffer[ i + 1 ] = 0x00;
    }
    /* ---- Fcn Process ---- */
    HAL_nRF24L01P_nSS_Low( nRF );  // notSlaveSelect pin is Low
    if ( HAL_SPI_TransmitReceive( nRF->hspi, tempTxBuffer, tempRxBuffer, Size + 1, nRF_SPI_TIMEOUT ) != HAL_OK ) {
        free( tempTxBuffer );
        free( tempRxBuffer );
        return HAL_ERROR;
    }
    /* ---- PostProcess ---- */
    for ( uint8_t i = 0; i < Size; i++ ) {
        RxBuffer[ i ] = tempRxBuffer[ i + 1 ];
    }
    HAL_nRF24L01P_nSS_High( nRF );  // notSlaveSelect pin is High
    free( tempTxBuffer );
    free( tempRxBuffer );
    return HAL_OK;
}

void HAL_nRF24L01P_nSS_High( nRF24L01P* nRF ) {
    HAL_GPIO_WritePin( nRF->nRF_nSS_GPIO_PORT, nRF->nRF_nSS_GPIO_PIN, GPIO_PIN_SET );
}
void HAL_nRF24L01P_nSS_Low( nRF24L01P* nRF ) {
    HAL_GPIO_WritePin( nRF->nRF_nSS_GPIO_PORT, nRF->nRF_nSS_GPIO_PIN, GPIO_PIN_RESET );
}
void HAL_nRF24L01P_CE_High( nRF24L01P* nRF ) {
    HAL_GPIO_WritePin( nRF->nRF_CE_GPIO_PORT, nRF->nRF_CE_GPIO_PIN, GPIO_PIN_SET );
}
void HAL_nRF24L01P_CE_Low( nRF24L01P* nRF ) {
    HAL_GPIO_WritePin( nRF->nRF_CE_GPIO_PORT, nRF->nRF_CE_GPIO_PIN, GPIO_PIN_RESET );
}
